Revit 2024 API
ParameterTypeId.ConnectorIndex Property
 "Index"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ConnectorIndex { get; }
Visual Basic
Public Shared ReadOnly Property ConnectorIndex As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ConnectorIndex {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace